scripts/artillery_scripts/Random_Foods_Read_Test/random-foods-read-ramp-up-test.yml
# 음식 설문 페이지 테스 고도화 test.yaml 파일
config:
  target: "https://api.delight99.co.kr"
  #target: "http://3.38.100.139"
  phases:
    - duration: 120
      arrivalRate: 100
      name: Warm up
    - duration: 180
      arrivalRate: 100
      rampTo: 250
      name: Ramp up load
    - duration: 180
      arrivalRate: 300
      name: Sustained load
    - duration: 60
      arrivalRate: 200
      name: Decrease start 
    - duration: 60
      arrivalRate: 100
      name: Decrease end
scenarios:
 - name: "Get Random Foods"
   flow:
    - get:
        url: "/api/foods"